In [12]:
import pandas as pd
from pandas import DataFrame

Load taxi data from January 2019 into a data frame using only the columns passenger_count, trip_distance, and total_amount.

In [2]:
filepath = r"C:\Users\dqthi\Downloads\pandas-workout-data\data\nyc_taxi_2019-01.csv"

ex = pd.read_csv(filepath, usecols=['passenger_count','trip_distance','total_amount'])

For each number of passengers, find the mean cost of a taxi ride. Sort this result from lowest (i.e., cheapest) to highest (i.e., most expensive).

In [3]:
ex.groupby('passenger_count')['total_amount'].mean()

passenger_count
0    18.663658
1    15.609601
2    15.831294
3    15.604015
4    15.650307
5    15.546940
6    15.437892
7    48.278421
8    64.105517
9    31.094444
Name: total_amount, dtype: float64

In [4]:
for i in range(ex['passenger_count'].max() + 1):
    print(i,
          ex.loc[ex['passenger_count'] == i,
                 'total_amount'
          ].mean())

0 18.663657576609502
1 15.60960133582081
2 15.831293988184253
3 15.604014635184814
4 15.650306636448246
5 15.546939865736997
6 15.43789214734253
7 48.27842105263158
8 64.1055172413793
9 31.09444444444445

Sort the results again by increasing the number of passengers.

In [5]:
ex.groupby('passenger_count')['total_amount'].mean().sort_index()

passenger_count
0    18.663658
1    15.609601
2    15.831294
3    15.604015
4    15.650307
5    15.546940
6    15.437892
7    48.278421
8    64.105517
9    31.094444
Name: total_amount, dtype: float64

Create a new column, trip_distance_group, in which the values are short (< 2 miles), medium (≥ 2 miles and ≤ 10 miles), and long (> 10 miles). What is the average number of passengers per trip length category? Sort this result from highest (most passengers) to lowest (fewest passengers).

In [6]:
# for i in ex['trip_distance']:
#     if i < 2: 
#         ex['trip_distance_group'] = 'short'
#     elif 2 <= i <= 10:
#         ex['trip_distance_group'] = 'medium'
#     else:
#         ex['trip_distance_group'] = 'long'

# print (ex)

In [7]:
# hahah, I made a silly mistake, i apply the fomular for this 2mil row dataset,

In [8]:
ex['trip_distance_group'] = pd.cut(
    ex['trip_distance'],[ex['trip_distance'].min(),2, 10, ex['trip_distance'].max()],
    labels= ['short', 'medium', 'long'],
    include_lowest=True
)

In [9]:
ex

         passenger_count  trip_distance  total_amount trip_distance_group
0                      1           1.50          9.95               short
1                      1           2.60         16.30              medium
2                      3           0.00          5.80               short
3                      5           0.00          7.55               short
4                      5           0.00         55.55               short
...                  ...            ...           ...                 ...
7667787                1           4.79         23.16              medium
7667788                1           0.00          0.00               short
7667789                1           0.00          0.00               short
7667790                1           0.00          0.00               short
7667791                1           0.00          0.00               short

[7667792 rows x 4 columns]

In [10]:
ex.groupby('trip_distance_group')['passenger_count'].mean().sort_values(ascending=True)

C:\Users\dqthi\AppData\Local\Temp\ipykernel_16840\4142780308.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  ex.groupby('trip_distance_group')['passenger_count'].mean().sort_values(ascending=True)

trip_distance_group
short     1.555906
medium    1.585319
long      1.590035
Name: passenger_count, dtype: float64

# Grouping

In [13]:
df = DataFrame([{'product_id':23, 'name':'computer',
                 'wholesale_price': 500,
                 'retail_price':1000, 'sales':100,
                 'department':'electronics'},
               {'product_id':96, 'name':'Python Workout',
                 'wholesale_price': 35,
                 'retail_price':75, 'sales':1000,
                 'department':'books'},
               {'product_id':97, 'name':'Pandas Workout',
                 'wholesale_price': 35,
                 'retail_price':75, 'sales':500,
                 'department':'books'},
               {'product_id':15, 'name':'banana',
                 'wholesale_price': 0.5,
                 'retail_price':1, 'sales':200,
                 'department':'food'},
               {'product_id':87, 'name':'sandwich',
                 'wholesale_price': 3,
                 'retail_price':5, 'sales':300,
                 'department': 'food'},
               ])

In [14]:
df

,product_id,name,wholesale_price,retail_price,sales,department
0,23,computer,500.0,1000,100,electronics
1,96,Python Workout,35.0,75,1000,books
2,97,Pandas Workout,35.0,75,500,books
3,15,banana,0.5,1,200,food
4,87,sandwich,3.0,5,300,food

In [15]:
df.count() # to check for how many row of value that I have in this dataframe

product_id         5
name               5
wholesale_price    5
retail_price       5
sales              5
department         5
dtype: int64

In [16]:
df.groupby('department')  # this will return the object of data type

In [18]:
df.groupby('department').count()['product_id']

# this result is a series whose index contais the different values in `department` and whose values contain the count of items per department.

department
books          2
electronics    1
food           2
Name: product_id, dtype: int64

In [19]:
df.groupby('department')['product_id'].count()
# this code is more resourcefull compared to the prior code as this select the column `product_id` then apply `count` method rather than doing the other way around, which is aplly `count` method to all the columns then just return the column `department`

department
books          2
electronics    1
food           2
Name: product_id, dtype: int64

In [ ]:
# there are several agrregation method when I use grouping apporach: 
# `mean`, `std`, `min`, `max`, `sum`

In [20]:
df.groupby('department')['retail_price'].mean()

department
books            75.0
electronics    1000.0
food              3.0
Name: retail_price, dtype: float64

In [21]:
df.groupby('department')['retail_price'].agg(['mean', 'std'])

# I can appy `agg` method to our `DataFrameGroupBy` object. this method takes a list of methods, each of which is applied to the `Groupby` object

               mean       std
department
books          75.0  0.000000
electronics  1000.0       NaN
food            3.0  2.828427

In [22]:
df.groupby('department').agg(mean_price=('retail_price', 'mean'),
                             std_price=('retail_price', 'std'),
                            max_sales=('sales', 'max'))

# using the `.agg` method to run multople aggregations on separate columns: 
# pass the entire `DataFrameGroupBy` object to `.agg`
# the key of each keyword argument is the name of an output column => `mean_price`, `std_price`, `max_sales`
# the value of each keyword argument is a two-element tuple: 
    # the first element in the tubple is a string - the name of the column in the original data frame that I want to analyze => 'retail_price`, `sale``
    # the second element in the tuple is also a string - the name of an aggregation method we wish to run on that column => 'max', 'std', 'mean'

             mean_price  std_price  max_sales
department
books              75.0   0.000000       1000
electronics      1000.0        NaN        100
food                3.0   2.828427        300

In [23]:
df.groupby('department', sort=False)['retail_price'].agg(['mean', 'std'])

# I can more `groupby` run a little bit faster through asking it not to sort. => sort=False 
# this will return the grouped items not in sorting order

               mean       std
department
electronics  1000.0       NaN
books          75.0  0.000000
food            3.0  2.828427

# Joining

In [24]:
df = DataFrame([{'product_id':23, 'name':'computer',
                 'wholesale_price': 500,
                 'retail_price':1000, 'sales':100,
                 'department':'electronics'},
               {'product_id':96, 'name':'Python Workout',
                 'wholesale_price': 35,
                 'retail_price':75, 'sales':1000,
                 'department':'books'},
               {'product_id':97, 'name':'Pandas Workout',
                 'wholesale_price': 35,
                 'retail_price':75, 'sales':500,
                 'department':'books'},
               {'product_id':15, 'name':'banana',
                 'wholesale_price': 0.5,
                 'retail_price':1, 'sales':200,
                 'department':'food'},
               {'product_id':87, 'name':'sandwich',
                 'wholesale_price': 3,
                 'retail_price':5, 'sales':300,
                 'department': 'food'},
               ])

In [25]:
df

,product_id,name,wholesale_price,retail_price,sales,department
0,23,computer,500.0,1000,100,electronics
1,96,Python Workout,35.0,75,1000,books
2,97,Pandas Workout,35.0,75,500,books
3,15,banana,0.5,1,200,food
4,87,sandwich,3.0,5,300,food

In [27]:
# break the data into two parts:

# One data frame will describe each of the products we sell.
# A second data frame will describe each sale we make.

In [26]:
products_df = DataFrame([{'product_id':23, 'name':'computer',
                          'wholesale_price': 500,
                          'retail_price':1000,
                          'department':'electronics'},
                        {'product_id':96, 'name':'Python Workout',
                         'wholesale_price': 35,
                         'retail_price':75, 'department':'books'},
                        {'product_id':97, 'name':'Pandas Workout',
                         'wholesale_price': 35,
                         'retail_price':75, 'department':'books'},
                        {'product_id':15, 'name':'banana',
                         'wholesale_price': 0.5,
                         'retail_price':1, 'department':'food'},
                        {'product_id':87, 'name':'sandwich',
                        'wholesale_price': 3,
                         'retail_price':5, 'department': 'food'},
                        ])
sales_df = DataFrame([{'product_id': 23, 'date':'2021-August-10',
                       'quantity':1},
                     {'product_id': 96, 'date':'2021-August-10',
                       'quantity':5},
                     {'product_id': 15, 'date':'2021-August-10',
                       'quantity':3},
                     {'product_id': 87, 'date':'2021-August-10',
                       'quantity':2},
                     {'product_id': 15, 'date':'2021-August-11',
                       'quantity':1},
                     {'product_id': 96, 'date':'2021-August-11',
                       'quantity':1},
                     {'product_id': 23, 'date':'2021-August-11',
                       'quantity':2},
                     {'product_id': 87, 'date':'2021-August-12',
                       'quantity':2},
                     {'product_id': 97, 'date':'2021-August-12',
                       'quantity':6},
                     {'product_id': 97, 'date':'2021-August-12',
                       'quantity':1},
                     {'product_id': 87, 'date':'2021-August-13',
                       'quantity':2},
                     {'product_id': 23, 'date':'2021-August-13',
                       'quantity':1},
                     {'product_id': 15, 'date':'2021-August-14',
                       'quantity':2}
                     ])

In [28]:
products_df

   product_id            name  wholesale_price  retail_price   department
0          23        computer            500.0          1000  electronics
1          96  Python Workout             35.0            75        books
2          97  Pandas Workout             35.0            75        books
3          15          banana              0.5             1         food
4          87        sandwich              3.0             5         food

In [29]:
sales_df

    product_id            date  quantity
0           23  2021-August-10         1
1           96  2021-August-10         5
2           15  2021-August-10         3
3           87  2021-August-10         2
4           15  2021-August-11         1
5           96  2021-August-11         1
6           23  2021-August-11         2
7           87  2021-August-12         2
8           97  2021-August-12         6
9           97  2021-August-12         1
10          87  2021-August-13         2
11          23  2021-August-13         1
12          15  2021-August-14         2

In [30]:
products_df = products_df.set_index('product_id')
sales_df = sales_df.set_index('product_id')

In [31]:
products_df.join(sales_df)

,name,wholesale_price,retail_price,department,date,quantity
product_id,,,,,,
23,computer,500.0,1000,electronics,2021-August-10,1
23,computer,500.0,1000,electronics,2021-August-11,2
23,computer,500.0,1000,electronics,2021-August-13,1
96,Python Workout,35.0,75,books,2021-August-10,5
96,Python Workout,35.0,75,books,2021-August-11,1
97,Pandas Workout,35.0,75,books,2021-August-12,6
97,Pandas Workout,35.0,75,books,2021-August-12,1
15,banana,0.5,1,food,2021-August-10,3
15,banana,0.5,1,food,2021-August-11,1
15,banana,0.5,1,food,2021-August-14,2
87,sandwich,3.0,5,food,2021-August-10,2
87,sandwich,3.0,5,food,2021-August-12,2
87,sandwich,3.0,5,food,2021-August-13,2

In [32]:
products_df.join(sales_df).groupby(
    'name')['quantity'].sum()

name
Pandas Workout    7
Python Workout    6
banana            6
computer          4
sandwich          6
Name: quantity, dtype: int64

In [33]:
products_df.join(sales_df).groupby(
    'name')['retail_price'].sum().sort_values()

name
banana               3
sandwich            15
Pandas Workout     150
Python Workout     150
computer          3000
Name: retail_price, dtype: int64

In [34]:
products_df.join(sales_df).groupby(
    'date')['retail_price'].sum().sort_index()

date
2021-August-10    1081
2021-August-11    1076
2021-August-12     155
2021-August-13    1005
2021-August-14       1
Name: retail_price, dtype: int64

In [35]:
products_df.join(sales_df).groupby(
    ['date','name'])['retail_price'].sum().sort_index()

date            name
2021-August-10  Python Workout      75
                banana               1
                computer          1000
                sandwich             5
2021-August-11  Python Workout      75
                banana               1
                computer          1000
2021-August-12  Pandas Workout     150
                sandwich             5
2021-August-13  computer          1000
                sandwich             5
2021-August-14  banana               1
Name: retail_price, dtype: int64